ut/src/AccumulationRegisters/АУ_ОплатаПоШифрам/АУ_ОплатаПоШифрам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АУ_ОплатаПоШифрам</name>
  <resources>
    <name>СуммаПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОплаты</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.АУ_СтатьиБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Программа</name>
    <type>
      <types>CatalogRef.АУ_Программы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ut/src/CommonModules/АУ_ОплатыПоЗаказамСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает шифр строки заказа: из наименования характеристики или реквизита АУ_Шифр (до 10 символов).
//
// Параметры:
//  НаименованиеХарактеристики - Строка
//  ШифрРеквизита - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ШифрСтрокиЗаказа(НаименованиеХарактеристики, ШифрРеквизита) Экспорт

	Если ЗначениеЗаполнено(НаименованиеХарактеристики) Тогда

		Возврат НормализоватьШифр(НаименованиеХарактеристики);

	КонецЕсли;

	Возврат НормализоватьШифр(ШифрРеквизита);

КонецФункции

// Разбивает строку шифров по запятой, обрезает каждый элемент до 10 символов.
//
// Параметры:
//  ШифрСтрокой - Строка
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция ШифрыСписка(ШифрСтрокой) Экспорт

	Результат = Новый Массив;

	Для Каждого Часть Из СтрРазделить(Строка(ШифрСтрокой), ",", Ложь) Цикл

		Шифр = НормализоватьШифр(Часть);

		Если Не ПустаяСтрока(Шифр) Тогда

			Результат.Добавить(Шифр);

		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Пересчитывает движения РН АУ_ОплатаПоШифрам по всем документам оплаты заказа.
//
// Параметры:
//  ЗаказКлиента - ДокументСсылка.ЗаказКлиента
//
Процедура ПересчитатьРаспределениеОплатЗаказа(ЗаказКлиента) Экспорт

	Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда

		Возврат;

	КонецЕсли;

	ДокументыОплаты = ДокументыОплатыЗаказа(ЗаказКлиента);
	РаспределениеПоЗаказам = РаспределенияДляДокументовОплаты(ДокументыОплаты, ЗаказКлиента);

	Для Каждого ДокументОплаты Из ДокументыОплаты Цикл

		ЗаписатьДвиженияПоДокументуИзРаспределений(ДокументОплаты, РаспределениеПоЗаказам);

	КонецЦикла;

КонецПроцедуры

// Пересчитывает движения РН по документу оплаты и связанным заказам.
//
// Параметры:
//  ДокументОплаты - ДокументСсылка
//
Процедура ПересчитатьРаспределениеПоДокументуОплаты(ДокументОплаты) Экспорт

	Если Не ЗначениеЗаполнено(ДокументОплаты) Тогда

		Возврат;

	КонецЕсли;

	ДокументыКОбновлению = ДокументыОплатыДляПересчета(ДокументОплаты);
	РаспределениеПоЗаказам = РаспределенияДляДокументовОплаты(ДокументыКОбновлению);

	Для Каждого Документ Из ДокументыКОбновлению Цикл

		ЗаписатьДвиженияПоДокументуИзРаспределений(Документ, РаспределениеПоЗаказам);

	КонецЦикла;

КонецПроцедуры

// Формирует движения РН АУ_ОплатаПоШифрам при проведении документа оплаты.
//
// Параметры:
//  ДокументОплаты - ДокументСсылка
//  СтатьиБюджета - ТабличнаяЧасть, ТаблицаЗначений
//  Период - Дата
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации
//  НаборДвижений - РегистрНакопленияНаборЗаписей.АУ_ОплатаПоШифрам
//
Процедура СформироватьДвиженияОплатаПоШифрам(ДокументОплаты, СтатьиБюджета, Период, ХозяйственнаяОперация, НаборДвижений) Экспорт

	Если Не ЭтоОплатаОтКлиента(ХозяйственнаяОперация) Тогда

		Возврат;

	КонецЕсли;

	Заказы = Новый Соответствие;

	Для Каждого СтрокаБюджета Из СтатьиБюджета Цикл

		Если ЗначениеЗаполнено(СтрокаБюджета.ЗаказКлиента) Тогда

			Заказы.Вставить(СтрокаБюджета.ЗаказКлиента, Истина);

		КонецЕсли;

	КонецЦикла;

	Для Каждого КлючИЗначение Из Заказы Цикл

		Распределение = РассчитатьРаспределениеЗаказа(КлючИЗначение.Ключ, ДокументОплаты, СтатьиБюджета);
		СтрокиДокумента = Распределение.Скопировать(Новый Структура("ДокументОплаты", ДокументОплаты));

		Для Каждого Строка Из СтрокиДокумента Цикл

			Движение = НаборДвижений.Добавить();
			Движение.Период = Период;
			Движение.ЗаказКлиента = Строка.ЗаказКлиента;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Шифр = Строка.Шифр;
			Движение.ДокументОплаты = ДокументОплаты;
			Движение.СтатьяБюджета = Строка.СтатьяБюджета;
			Движение.Программа = Строка.Программа;
			Движение.Объект = Строка.Объект;
			Движение.СуммаПриход = Строка.СуммаПриход;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НормализоватьШифр(Шифр)

	Возврат Лев(СокрЛП(Строка(Шифр)), 10);

КонецФункции

Функция ЭтоОплатаОтКлиента(ХозяйственнаяОперация)

	Возврат ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиентаПоПлатежнойКарте;

КонецФункции

Функция НоваяТаблицаРаспределения()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ЗаказКлиента");
	Таблица.Колонки.Добавить("Номенклатура");
	Таблица.Колонки.Добавить("Шифр");
	Таблица.Колонки.Добавить("ДокументОплаты");
	Таблица.Колонки.Добавить("СтатьяБюджета");
	Таблица.Колонки.Добавить("Программа");
	Таблица.Колонки.Добавить("Объект");
	Таблица.Колонки.Добавить("СуммаПриход", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	Возврат Таблица;

КонецФункции

Функция ДокументыОплатыДляПересчета(ДокументОплаты)

	Результат = Новый Массив;
	УникальныеДокументы = Новый Соответствие;
	УникальныеДокументы.Вставить(ДокументОплаты, Истина);

	Заказы = ЗаказыДокументаОплаты(ДокументОплаты);

	Для Каждого ЗаказКлиента Из Заказы Цикл

		Для Каждого Док Из ДокументыОплатыЗаказа(ЗаказКлиента) Цикл

			УникальныеДокументы.Вставить(Док, Истина);

		КонецЦикла;

	КонецЦикла;

	Для Каждого КлючИЗначение Из УникальныеДокументы Цикл

		Результат.Добавить(КлючИЗначение.Ключ);

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция РаспределенияДляДокументовОплаты(ДокументыОплаты, ДополнительныйЗаказ = Неопределено)

	ЗаказыКРасчету = Новый Соответствие;

	Если ЗначениеЗаполнено(ДополнительныйЗаказ) Тогда

		ЗаказыКРасчету.Вставить(ДополнительныйЗаказ, Истина);

	КонецЕсли;

	Для Каждого ДокументОплаты Из ДокументыОплаты Цикл

		Для Каждого ЗаказКлиента Из ЗаказыДокументаОплаты(ДокументОплаты) Цикл

			ЗаказыКРасчету.Вставить(ЗаказКлиента, Истина);

		КонецЦикла;

	КонецЦикла;

	РаспределениеПоЗаказам = Новый Соответствие;

	Для Каждого КлючИЗначение Из ЗаказыКРасчету Цикл

		РаспределениеПоЗаказам.Вставить(КлючИЗначение.Ключ, РассчитатьРаспределениеЗаказа(КлючИЗначение.Ключ));

	КонецЦикла;

	Возврат РаспределениеПоЗаказам;

КонецФункции

Процедура ЗаписатьДвиженияПоДокументуИзРаспределений(ДокументОплаты, РаспределениеПоЗаказам)

	СтрокиДокумента = НоваяТаблицаРаспределения();
	ЗаказыДокумента = ЗаказыДокументаОплаты(ДокументОплаты);

	Для Каждого ЗаказКлиента Из ЗаказыДокумента Цикл

		РаспределениеЗаказа = РаспределениеПоЗаказам.Получить(ЗаказКлиента);

		Если РаспределениеЗаказа = Неопределено Тогда

			Продолжить;

		КонецЕсли;

		СтрокиЗаказа = РаспределениеЗаказа.Скопировать(Новый Структура("ДокументОплаты", ДокументОплаты));

		Для Каждого Строка Из СтрокиЗаказа Цикл

			ЗаполнитьЗначенияСвойств(СтрокиДокумента.Добавить(), Строка);

		КонецЦикла;

	КонецЦикла;

	ЗаписатьДвиженияРегистра(ДокументОплаты, СтрокиДокумента);

КонецПроцедуры

Процедура ЗаписатьДвиженияРегистра(ДокументОплаты, ТаблицаРаспределения)

	Период = ПериодДокументаОплаты(ДокументОплаты);

	УстановитьПривилегированныйРежим(Истина);

	Набор = РегистрыНакопления.АУ_ОплатаПоШифрам.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ДокументОплаты);
	Набор.Прочитать();
	Набор.Очистить();

	Для Каждого Строка Из ТаблицаРаспределения Цикл

		Если Строка.СуммаПриход = 0 Тогда

			Продолжить;

		КонецЕсли;

		Движение = Набор.Добавить();
		Движение.Период = Период;
		Движение.ЗаказКлиента = Строка.ЗаказКлиента;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Шифр = Строка.Шифр;
		Движение.ДокументОплаты = ДокументОплаты;
		Движение.СтатьяБюджета = Строка.СтатьяБюджета;
		Движение.Программа = Строка.Программа;
		Движение.Объект = Строка.Объект;
		Движение.СуммаПриход = Строка.СуммаПриход;

	КонецЦикла;

	Набор.Записать();

КонецПроцедуры

Функция ПериодДокументаОплаты(ДокументОплаты)

	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда

		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОплаты, "Дата, ДатаПроведенияБанком");
		ДатаДокумента = ?(ЗначениеЗаполнено(Реквизиты.ДатаПроведенияБанком), Реквизиты.ДатаПроведенияБанком, Реквизиты.Дата);

	Иначе

		ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "Дата");

	КонецЕсли;

	Возврат ДатаДокумента;

КонецФункции

Функция ЗаказыДокументаОплаты(ДокументОплаты)

	Заказы = Новый Массив;

	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Статьи.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств.АУ_СтатьиБюджета КАК Статьи
		|ГДЕ
		|	Статьи.Ссылка = &ДокументОплаты
		|	И Статьи.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
		Заказы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказКлиента");

	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда

		ДополнитьЗаказыДокументаОплатыПКО(Заказы, ДокументОплаты);

	КонецЕсли;

	Возврат Заказы;

КонецФункции

Процедура ДополнитьЗаказыДокументаОплатыПКО(Заказы, ДокументОплаты)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Статьи.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.АУ_СтатьиБюджета КАК Статьи
	|ГДЕ
	|	Статьи.Ссылка = &ДокументОплаты
	|	И Статьи.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);

	Попытка

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Заказы, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказКлиента"), Истина);

	Исключение

		// ТЧ АУ_СтатьиБюджета ПКО без полной аналитики — до обновления конфигурации.

	КонецПопытки;

КонецПроцедуры

Функция ДокументыОплатыЗаказа(ЗаказКлиента)

	ДокументыОплаты = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Оплата.ДокументОплаты КАК ДокументОплаты
	|ИЗ
	|	РегистрНакопления.АУ_ОплатаПоШифрам КАК Оплата
	|ГДЕ
	|	Оплата.ЗаказКлиента = &ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Статьи.Ссылка
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.АУ_СтатьиБюджета КАК Статьи
	|ГДЕ
	|	Статьи.ЗаказКлиента = &ЗаказКлиента
	|	И Статьи.Ссылка.Проведен
	|	И Статьи.Ссылка.ХозяйственнаяОперация В (&ОперацииОплатыОтКлиента)";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("ОперацииОплатыОтКлиента", ОперацииОплатыОтКлиента());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыОплаты, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОплаты"), Истина);

	ДополнитьДокументыОплатыЗаказаПКО(ДокументыОплаты, ЗаказКлиента);

	Возврат ДокументыОплаты;

КонецФункции

Процедура ДополнитьДокументыОплатыЗаказаПКО(ДокументыОплаты, ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Статьи.Ссылка КАК ДокументОплаты
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.АУ_СтатьиБюджета КАК Статьи
	|ГДЕ
	|	Статьи.ЗаказКлиента = &ЗаказКлиента
	|	И Статьи.Ссылка.Проведен
	|	И Статьи.Ссылка.ХозяйственнаяОперация = &ОперацияПКО";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("ОперацияПКО", Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);

	Попытка

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыОплаты, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОплаты"), Истина);

	Исключение

		// ТЧ АУ_СтатьиБюджета ПКО без полной аналитики — до обновления конфигурации.

	КонецПопытки;

КонецПроцедуры

Функция ОперацииОплатыОтКлиента()

	Операции = Новый Массив;
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиентаПоПлатежнойКарте);

	Возврат Операции;

КонецФункции

Функция ОплатыЗаказа(ЗаказКлиента, ДокументОплаты = Неопределено, СтатьиБюджета = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Ссылка КАК ДокументОплаты,
	|	Статьи.СтатьяБюджета КАК СтатьяБюджета,
	|	Статьи.Программа КАК Программа,
	|	Статьи.Объект КАК Объект,
	|	Статьи.Шифр КАК Шифр,
	|	Статьи.Сумма КАК Сумма,
	|	ЕСТЬNULL(Статьи.Ссылка.ДатаПроведенияБанком, Статьи.Ссылка.Дата) КАК ДатаОплаты,
	|	Статьи.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.АУ_СтатьиБюджета КАК Статьи
	|ГДЕ
	|	Статьи.ЗаказКлиента = &ЗаказКлиента
	|	И Статьи.Ссылка.Проведен
	|	И Статьи.Ссылка.ХозяйственнаяОперация В(&ОперацииОплатыОтКлиента)
	|	И Статьи.Ссылка <> &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты,
	|	ДатаДокумента,
	|	ДокументОплаты";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("ОперацииОплатыОтКлиента", ОперацииОплатыОтКлиента());
	Запрос.УстановитьПараметр("Ссылка", ДокументОплаты);

	Оплаты = Запрос.Выполнить().Выгрузить();
	ДополнитьОплатамиЗаказаПКО(Оплаты, ЗаказКлиента, ДокументОплаты);
	ДополнитьОплатамиТекущегоДокумента(Оплаты, ЗаказКлиента, ДокументОплаты, СтатьиБюджета);
	Оплаты.Сортировать("ДатаОплаты, ДатаДокумента, ДокументОплаты");

	Возврат Оплаты;

КонецФункции

Процедура ДополнитьОплатамиЗаказаПКО(Оплаты, ЗаказКлиента, ДокументОплаты)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Ссылка КАК ДокументОплаты,
	|	Статьи.СтатьяБюджета КАК СтатьяБюджета,
	|	Статьи.Программа КАК Программа,
	|	Статьи.Объект КАК Объект,
	|	Статьи.Шифр КАК Шифр,
	|	Статьи.Сумма КАК Сумма,
	|	Статьи.Ссылка.Дата КАК ДатаОплаты,
	|	Статьи.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.АУ_СтатьиБюджета КАК Статьи
	|ГДЕ
	|	Статьи.ЗаказКлиента = &ЗаказКлиента
	|	И Статьи.Ссылка.Проведен
	|	И Статьи.Ссылка.ХозяйственнаяОперация = &ОперацияПКО
	|	И Статьи.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("ОперацияПКО", Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	Запрос.УстановитьПараметр("Ссылка", ДокументОплаты);

	Попытка

		ОплатыПКО = Запрос.Выполнить().Выгрузить();

		Для Каждого Строка Из ОплатыПКО Цикл

			НоваяСтрока = Оплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);

		КонецЦикла;

	Исключение

		// ТЧ АУ_СтатьиБюджета ПКО без полной аналитики — до обновления конфигурации.

	КонецПопытки;

КонецПроцедуры

Процедура ДополнитьОплатамиТекущегоДокумента(Оплаты, ЗаказКлиента, ДокументОплаты, СтатьиБюджета)

	Если Не ЗначениеЗаполнено(ДокументОплаты) Или СтатьиБюджета = Неопределено Тогда

		Возврат;

	КонецЕсли;

	Для Каждого СтрокаБюджета Из СтатьиБюджета Цикл

		Если СтрокаБюджета.ЗаказКлиента <> ЗаказКлиента Тогда

			Продолжить;

		КонецЕсли;

		НоваяСтрока = Оплаты.Добавить();
		НоваяСтрока.ДокументОплаты = ДокументОплаты;
		НоваяСтрока.СтатьяБюджета = СтрокаБюджета.СтатьяБюджета;
		НоваяСтрока.Программа = СтрокаБюджета.Программа;
		НоваяСтрока.Объект = СтрокаБюджета.Объект;
		НоваяСтрока.Шифр = СтрокаБюджета.Шифр;
		НоваяСтрока.Сумма = СтрокаБюджета.Сумма;
		НоваяСтрока.ДатаОплаты = ПериодДокументаОплаты(ДокументОплаты);
		НоваяСтрока.ДатаДокумента = НоваяСтрока.ДатаОплаты;

	КонецЦикла;

КонецПроцедуры

Функция РассчитатьРаспределениеЗаказа(ЗаказКлиента, ДокументОплаты = Неопределено, СтатьиБюджета = Неопределено)

	Результат = НоваяТаблицаРаспределения();
	СтрокиЗаказа = СтрокиЗаказаКлиента(ЗаказКлиента);
	Оплаты = ОплатыЗаказа(ЗаказКлиента, ДокументОплаты, СтатьиБюджета);

	Если СтрокиЗаказа.Количество() = 0 Или Оплаты.Количество() = 0 Тогда

		Возврат Результат;

	КонецЕсли;

	СуммаЗаказа = СтрокиЗаказа.Итог("СуммаЗаказа");
	СуммаОплат = Оплаты.Итог("Сумма");
	РежимПереплаты = СуммаОплат > СуммаЗаказа И СуммаЗаказа > 0;

	СтрокиЗаказа.Колонки.Добавить("НакопленоОплата", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	СтрокиЗаказа.ЗаполнитьЗначения(0, "НакопленоОплата");

	Для Каждого Оплата Из Оплаты Цикл

		ШифрыОплаты = ШифрыСписка(Оплата.Шифр);
		Кандидаты = ОтобратьКандидатов(СтрокиЗаказа, ШифрыОплаты);

		Если Кандидаты.Количество() = 0 Тогда

			Продолжить;

		КонецЕсли;

		РаспределениеОплаты = РаспределитьСуммуОплаты(Оплата.Сумма, Кандидаты, РежимПереплаты);

		Для Каждого СтрокаРаспределения Из РаспределениеОплаты Цикл

			СтрокаЗаказа = СтрокиЗаказа[СтрокаРаспределения.ИндексСтроки];
			СтрокаЗаказа.НакопленоОплата = СтрокаЗаказа.НакопленоОплата + СтрокаРаспределения.Сумма;

			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ЗаказКлиента = ЗаказКлиента;
			НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
			НоваяСтрока.Шифр = СтрокаЗаказа.Шифр;
			НоваяСтрока.ДокументОплаты = Оплата.ДокументОплаты;
			НоваяСтрока.СтатьяБюджета = Оплата.СтатьяБюджета;
			НоваяСтрока.Программа = Оплата.Программа;
			НоваяСтрока.Объект = Оплата.Объект;
			НоваяСтрока.СуммаПриход = СтрокаРаспределения.Сумма;

		КонецЦикла;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СтрокиЗаказаКлиента(ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ПОДСТРОКА(СокрЛП(ВЫБОР
	|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Характеристика.Наименование
	|		ИНАЧЕ Товары.АУ_Шифр
	|	КОНЕЦ), 1, 10) КАК Шифр,
	|	СУММА(Товары.СуммаСНДС) КАК СуммаЗаказа
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	ПОДСТРОКА(СокрЛП(ВЫБОР
	|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Характеристика.Наименование
	|		ИНАЧЕ Товары.АУ_Шифр
	|	КОНЕЦ), 1, 10)";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);

	Таблица = Запрос.Выполнить().Выгрузить();

	Для Каждого Строка Из Таблица Цикл

		Строка.Шифр = НормализоватьШифр(Строка.Шифр);

	КонецЦикла;

	Возврат Таблица;

КонецФункции

Функция ОтобратьКандидатов(СтрокиЗаказа, ШифрыОплаты)

	Кандидаты = Новый Массив;

	Для Индекс = 0 По СтрокиЗаказа.Количество() - 1 Цикл

		Строка = СтрокиЗаказа[Индекс];

		Если СтрокаПодходитПодОплату(Строка.Шифр, ШифрыОплаты) Тогда

			Кандидаты.Добавить(Новый Структура("ИндексСтроки, СуммаЗаказа, НакопленоОплата", Индекс, Строка.СуммаЗаказа, Строка.НакопленоОплата));

		КонецЕсли;

	КонецЦикла;

	Возврат Кандидаты;

КонецФункции

Функция СтрокаПодходитПодОплату(ШифрСтроки, ШифрыОплаты)

	Если ШифрыОплаты.Количество() = 0 Тогда

		Возврат Истина;

	КонецЕсли;

	Для Каждого Шифр Из ШифрыОплаты Цикл

		Если Шифр = ШифрСтроки Тогда

			Возврат Истина;

		КонецЕсли;

	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция РаспределитьСуммуОплаты(СуммаОплаты, Кандидаты, РежимПереплаты)

	Результат = Новый Массив;

	Если СуммаОплаты = 0 Тогда

		Возврат Результат;

	КонецЕсли;

	БазаРаспределения = 0;

	Для Каждого Кандидат Из Кандидаты Цикл

		БазаРаспределения = БазаРаспределения + Кандидат.СуммаЗаказа;

	КонецЦикла;

	Если БазаРаспределения = 0 Тогда

		Возврат Результат;

	КонецЕсли;

	Остаток = СуммаОплаты;
	Доли = Новый Массив;

	Для Каждого Кандидат Из Кандидаты Цикл

		ИдеальнаяДоля = Окр(СуммаОплаты * Кандидат.СуммаЗаказа / БазаРаспределения, 2);

		Если РежимПереплаты Тогда

			Доля = ИдеальнаяДоля;
		Иначе

			Доступно = Макс(Кандидат.СуммаЗаказа - Кандидат.НакопленоОплата, 0);
			Доля = Мин(ИдеальнаяДоля, Доступно);

		КонецЕсли;

		Доли.Добавить(Новый Структура("ИндексСтроки, Сумма", Кандидат.ИндексСтроки, Доля));
		Остаток = Остаток - Доля;

	КонецЦикла;

	Если Не РежимПереплаты И Остаток > 0.009 Тогда

		ПерераспределитьОстаток(Доли, Кандидаты, Остаток);

	КонецЕсли;

	Для Каждого Элемент Из Доли Цикл

		Если Элемент.Сумма <> 0 Тогда

			Результат.Добавить(Элемент);

		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ПерераспределитьОстаток(Доли, Кандидаты, Остаток)

	Пока Остаток > 0.009 Цикл

		БылПрогресс = Ложь;

		Для Индекс = 0 По Доли.Количество() - 1 Цикл

			Доля = Доли[Индекс];
			Кандидат = Кандидаты[Индекс];
			Доступно = Макс(Кандидат.СуммаЗаказа - Кандидат.НакопленоОплата - Доля.Сумма, 0);

			Если Доступно <= 0 Тогда

				Продолжить;

			КонецЕсли;

			Прирост = Мин(Доступно, Остаток);
			Доля.Сумма = Доля.Сумма + Прирост;
			Остаток = Остаток - Прирост;
			БылПрогресс = Истина;

			Если Остаток <= 0.009 Тогда

				Прервать;

			КонецЕсли;

		КонецЦикла;

		Если Не БылПрогресс Тогда

			Прервать;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
